$(function(){
	var $yy_province,$yy_city,$yy_dealer,$yy_address, $btn_submit, $yuyue_form;
	//预约经销商数据格式： 省会:{ 城市:{经销商:[地址] , 经销商:[地址]} , 城市:{经销商:[地址] , 经销商:[地址]} }
	var $yuyue={"黑龙江省":{"哈尔滨市":["哈尔滨新纪元","哈尔滨融展东日","哈尔滨融展兴邦"],"大庆市":["大庆天创","大庆易盛","大庆勤华瑞嘉"],"牡丹江市":["牡丹江佰佳"],"齐齐哈尔":["齐齐哈尔瑞迪","齐齐哈尔华宇瑞通"],"绥化市":["绥化融展绥鑫"],"双鸭山市":["双鸭山凯华运通"],"七台河市":["七台河隆达金信"],"鸡西市":["鸡西勤华俊达"],"鹤岗市":["鹤岗凯华运通东山"],"佳木斯市":["佳木斯凯华运通"]},"吉林省":{"长春市":["长春金达洲凯绅","长春瑞孚","长春金达洲恒瑞","长春恒源","长春融展长沈路"],"吉林市":["吉林瑞孚环宇","四平申达","吉林融展瑞合"],"延吉市":["延吉瑞孚隆兴"],"松原市":["松原金达洲"],"通化市":["通化孚胜达"],"辽源市":["辽源融展鑫源"],"白城市":["白城融展兴邦经开"]},"辽宁省":{"沈阳市":["沈阳东北汽贸","沈阳新世纪","沈阳中升捷通","沈阳汇丰沈大","沈阳东北汽贸东辰","沈阳中升越通","沈阳中晨诚隆"],"大连市":["大连华圣","大连中升奥通","大连中升搏通","大连英和保税区","大连华凯"],"葫芦岛市":["葫芦岛川达"],"鞍山市":["鞍山亿通东尼","鞍山亿通东亿"],"锦州市":["锦州维立达"],"营口市":["营口英和大通"],"盘锦市":["盘锦英和"],"朝阳市":["朝阳百盛"],"丹东市":["丹东英和花园"],"辽阳市":["辽阳亿通日成"],"本溪市":["本溪英和卧龙"],"阜新市":["阜新全一"],"铁岭市":["铁岭英和凡河"],"抚顺市":["抚顺东北汽贸瑞晟"]},"北京市":{"北京市":["北京华盛昌","北京汇京鸿运","北京东风南方三合","北京东风南方亮马","北京中汽雷日","北京森华佳运","北京福源","北京宏远信诚","北京华盛昌百旺","北京汇京世纪","北京通和盛远","北京东方华中","北京浩洋正业","北京鑫达润城","北京海润嘉","北京冀东兴","北京汇京福瑞","北京航天正通","北京祥瑞聚鑫","北京东风南方大成","北京晟通"]},"天津市":{"天津市":["天津长江","天津新濠","天津津日","天津新骏濠","天津名濠","天津滨海","天津名宣","天津名达","天津浩物武清"]},"内蒙古":{"呼和浩特市":["呼和浩特鼎杰","呼和浩特鼎泽","呼和浩特利丰泰津"],"包头市":["包头金达","包头东信鑫达"],"鄂尔多斯市":["鄂尔多斯银达"],"赤峰市":["赤峰世鹏","赤峰金鹏"],"巴彦淖尔":["巴彦淖尔东信泰达"],"呼伦贝尔市":["呼伦贝尔庞大广源"],"锡林浩特市":["锡林浩特嘉洋"],"通辽市":["通辽利丰泰昌","通辽龙兴伟业"],"兴安盟":["兴安盟华楠","兴安盟利龙扎旗"]},"河北省":{"石家庄市":["石家庄中升海悦","石家庄东风南方联德"],"唐山市":["唐山冀东","唐山冀龙","唐山佳源","唐山汇京唐信","唐山庞大华源"],"保定市":["保定力宏","保定轩宇久久","高碑店庞大庆源","保定东风南方和顺","保定东风南方涿州","保定东风南方定州"],"秦皇岛市":["秦皇岛佳浩","秦皇岛京德","秦皇岛京佰"],"廊坊市":["廊坊乐业","廊坊华盛昌广阳"],"邯郸市":["邯郸富信","邯郸恒信东顺","邯郸东风南方武安","邯郸东风南方南环"],"邢台市":["邢台圣士龙","邢台蓝池成龙","邢台蓝池桂龙","南宫蓝池泽龙"],"沧州市":["沧州佳鑫","沧州瑞鑫","沧州东风南方沧运","沧州东风南方任丘","河间东风南方泰丽"],"衡水市":["衡水伴福","衡水蓝池泽龙桃城"],"张家口市":["张家口华联腾飞","张家口庞大张宣路"],"承德市":["承德庞大飞源"]},"山西省":{"长治市":["长治东升","长治蓝池冠龙"],"太原市":["太原大源","太原汇泽","太原东润","太原东汇"],"大同市":["大同云岗","大同东昊"],"临汾市":["临汾东盛源","临汾新盛源"],"晋城市":["晋城华洋"],"运城市":["运城万通","运城瑞盈","运城瑞盈河津"],"晋中市":["晋中东风南方汇盛","晋中汇隆"],"朔州市":["朔州汇海","怀仁云山"],"吕梁":["吕梁庞大孝义鸿源"],"阳泉市":["阳泉东风南方太行"]},"新疆":{"乌鲁木齐市":["乌鲁木齐天中","乌鲁木齐博望","乌鲁木齐卓辉","乌鲁木齐汇京凯立乌昌"],"库尔勒市":["库尔勒瑞丰"],"克拉玛依市":["克拉玛依浩辉"],"阿克苏市":["阿克苏奕辉"],"哈密市":["哈密泰辉"],"昌吉市":["昌吉汇京昌盛"],"伊宁市":["伊犁天汇华旭"],"喀什市":["喀什卓辉"],"和田市":["和田天中"]},"宁夏":{"银川市":["银川京胜","银川弘胜金凤"],"固原市":["固原正通"]},"甘肃省":{"兰州市":["兰州鑫通","兰州良志","兰州泰华"],"酒泉地区":["酒泉良志"],"天水市":["天水良志"],"白银市":["白银恒信东顺"],"平凉地区":["平凉恒信东顺东湖"],"定西地区":["定西恒信东顺"],"庆阳地区":["庆阳良志陇东汽车城"],"武威地区":["武威鑫成"]},"青海省":{"西宁市":["西宁青鹏","西宁嘉运"],"海西州":["格尔木世纪开发区"]},"山东省":{"潍坊市":["潍坊天达","潍坊恒安","潍坊珠峰青江","潍坊天成","寿光华神鼎泰"],"济南市":["济南大友","济南龙腾","济南金大友","章丘大友明","济南银大友","济南骏大友"],"青岛市":["青岛中升鑫搏通","青岛中升顺通","青岛中升智通","青岛天也","青岛中升庆通","青岛珠峰平度","青岛珠峰胶州","青岛珠峰城阳","青岛敏田莱西"],"烟台市":["烟台天航","烟台富嘉","烟台远方泰龙","烟台珠峰莱州","烟台天健鑫远"],"淄博市":["淄博泰达","淄博泰通","淄博远方骏顺","淄博航天锦诚","淄博天兴"],"临沂市":["临沂易通","临沂易利","临沂易丰","临沂易华","临沂易通沂水","临沂易捷"],"威海市":["威海世通","荣成海源","文登永通"],"济宁市":["济宁东风南方东源","济宁华源","曲阜华源圣达","邹城东风南方宝丰源","济宁华源通达梁山"],"东营市":["东营慧达","东营兴达","东营顺达润嘉"],"日照市":["日照海正","日照易通旭日"],"枣庄市":["枣庄远方","枣庄天朗"],"莱芜市":["莱芜顺通"],"滨州市":["滨州通达","滨州远泰","滨州圣瑞"],"德州市":["德州华丰","德州远通","德州国信临邑"],"聊城市":["聊城天瑞","聊城东风南方金天瑞"],"泰安市":["泰安嘉信","泰安嘉信泰山","泰安嘉信新泰"],"诸城市":["诸城英华"],"渮泽市":["菏泽东风南方开源","菏泽东风南方佳达","菏泽东风南方广达"],"莱阳市":["烟台珠峰莱阳"],"青州市":["潍坊珠峰青州"],"龙口市":["龙口天健"]},"陕西省":{"西安市":["西安佳益","西安忠伟","西安佳泰","西安英和幸福","西安英和三桥"],"榆林市":["榆林佳福","榆林英和汇通"],"宝鸡市":["宝鸡福华"],"咸阳市":["咸阳英和渭城","咸阳福瑞秦都"],"渭南市":["渭南佳圣"],"延安市":["延安英和"],"汉中市":["汉中英和天汉"],"铜川市":["铜川泽泰盛隆王益"],"安康市":["安康合裕"]},"上海市":{"上海市":["上海绅协","上海众泰","上海锦江","上海隆利","上海松江","上海绅协绅通","上海宝钢","上海冠松","上海隆佳","上海金丰","上海庞大丰源青浦","上海锦江城市","上海东浦五洲大道","上海冠松闸北"]},"浙江省":{"杭州市":["杭州东风南方杭城","杭州元通友通","杭州万风","杭州元通港昌","杭州元通城北","杭州东风南方通惠","临安君悦","杭州东风南方滨安","杭州东风南方宁新","杭州元通富阳"],"宁波市":["宁波中汽","宁波庞大宁盛江东","宁波元通友和","宁海众兴","慈溪锦隆","象山众博"],"金华市":["金华大昌","永康元通友米","浦江元通百通","金华大昌汽车城"],"温州市":["温州华鸿","苍南汇佳","温州华成","温州嘉鸿","温州龙锦"],"台州市":["台州森曦","台州铠利","台州森元","台州绿地锦泰"],"嘉兴市":["嘉兴康桥","嘉兴之远","嘉兴百恒","海宁百胜"],"义乌市":["义乌元通广通","义乌经发"],"瑞安市":["瑞安东晨"],"湖州市":["湖州东风南方金恒德","湖州宝吉","湖州东风南方常兴"],"慈溪市":["慈溪飞跃"],"温岭市":["温岭恒泰"],"乐清市":["乐清宝鑫"],"衢州市":["衢州德众"],"舟山市":["舟山弘泰"],"余姚市":["余姚东风南方恒田"],"临海市":["临海万森特"],"绍兴市":["绍兴柯城","绍兴广成东成","上虞元通日通","绍兴广成八达"],"桐乡市":["桐乡中顺"],"丽水市":["丽水瓯翔南城"]},"江苏省":{"昆山市":["昆山华明"],"常熟市":["常熟海邦"],"扬州市":["扬州东风南方东峻","扬州东风南方扬辰"],"南京市":["南京华星","南京文华","南京汉虹","南京福宁"],"徐州市":["徐州润东淮海","徐州沪彭"],"南通市":["南通太平洋","南通海通","南通名尼威","南通太平洋海安","南通太平洋如东","南通太平洋启东","南通太平洋开发区","南通太平洋如皋"],"镇江市":["镇江天安达","镇江福宁句容","镇江天安达丹阳"],"苏州市":["苏州风顺","苏州伟海","苏州华达","苏州相诚","苏州诚邦松陵","苏州诚品甪直","昆山东风南方华翔达","太仓诚茂"],"常州市":["常州中天","常州中天日新","溧阳中天日盛","常州中天日晟","常州中天日昇"],"无锡市":["无锡明乐","无锡威孚","无锡广联达","无锡威邦新区","宜兴日晨"],"连云港市":["连云港润东天澜"],"江阴市":["江阴全顺海华","江阴南华"],"宿迁市":["宿迁良宇万福","沭阳良宇永福"],"盐城市":["盐城苏缘","盐城太平洋建湖","盐城太平洋东台"],"泰州市":["泰州东风南方天辰","泰州东风南方江平"],"淮安市":["淮安雨田","淮安益昌"],"吴江市":["吴江连诚"],"张家港市":["苏州大冈张家港"]},"安徽省":{"合肥市":["合肥伟业","合肥伟盛行","合肥恒信东顺合肥北","合肥风之星"],"蚌埠市":["蚌埠皖之星"],"芜湖市":["芜湖福兆","芜湖亚威"],"安庆市":["安庆恒业"],"铜陵市":["铜陵顺达"],"马鞍山市":["马鞍山伟德"],"宣城市":["宣城亚腾"],"淮北市":["淮北华松"],"六安市":["六安伟恒","六安安徽汽贸金安"],"黄山市":["黄山亚骐"],"滁州市":["滁州正和"],"淮南市":["淮南中骏"],"宿州市":["宿州润东"],"阜阳市":["阜阳中源开发区"],"亳州市":["亳州亚夏谯城"],"池州市":["池州顺达贵池"]},"河南省":{"郑州市":["郑州中原","郑州威佳","郑州威达","郑州威佳宏远","郑州东风南方威耀","郑州东风南方郑工","郑州威佳宏义","郑州威佳新郑","郑州威骏中牟"],"平顶山市":["平顶山威泰","平顶山威佳宏泰"],"新乡市":["新乡威兴","新乡威佳宏骏","新乡威佳宏兴","新乡威佳辉县威兴"],"焦作市":["焦作威佳未来"],"濮阳市":["濮阳威隆","濮阳威佳高新"],"信阳市":["信阳威通","信阳威佳潢川"],"漯河市":["漯河润翔"],"三门峡市":["三门峡威顺"],"开封市":["开封威瑞"],"周口市":["周口威诚","周口宏诚"],"驻马店市":["驻马店威浩"],"洛阳市":["洛阳威丰","洛阳威佳宏盛","洛阳威佳偃师"],"济源市":["济源威源"],"南阳市":["南阳威佳宏昌","南阳威佳镇平"],"商丘市":["商丘威佳宏祥","商丘威佳永城"],"安阳市":["安阳威佳文峰","安阳威佳宏泽"],"许昌市":["许昌威佳宏旺","许昌威佳禹州"],"鹤壁市":["鹤壁威佳宏利"]},"湖北省":{"武汉市":["武汉三环劲通","武汉三环华通","武汉三环诚通汉口","武汉开泰","武汉裕信","武汉三环博通","武汉三环轩通","武汉宏信车友","武汉三环易通"],"襄樊市":["襄阳车城","襄阳樊城"],"宜昌市":["宜昌交运","宜昌交运麟汇"],"十堰市":["十堰东贸","十堰东贸轩威"],"荆州市":["荆州恒信"],"黄石市":["黄石恒信东顺","黄石乾通黄金山"],"咸宁市":["咸宁恒信南星"],"黄冈市":["黄冈恒信德龙"],"恩施市":["恩施麟觉"],"荆门市":["荆门风雅"],"随州市":["随州东盛"],"孝感市":["孝感裕丰"],"潜江市":["潜江三环劲通天驰"],"鄂州市":["鄂州三环劲通江碧"],"仙桃市":["仙桃三环劲通仙桃"]},"江西省":{"南昌市":["南昌洪城","南昌洪都","南昌汇恒","南昌东维高鑫"],"赣州市":["赣州东维","赣州东维红金","赣州利泰赣县"],"上饶市":["上饶东信"],"萍乡市":["萍乡东安"],"九江市":["九江东浔"],"宜春市":["宜春东维林泰","宜春利泰袁州"],"景德镇市":["景德镇和谐"],"吉安市":["吉安东维兴达利","吉安通九州青原"],"抚州市":["抚州汇恒抚北"],"新余市":["新余利隆仙女湖"],"鹰潭市":["鹰潭鑫亚天洁"]},"湖南省":{"长沙市":["长沙星沙","长沙华洋星城","长沙兰天城西","长沙兰天河西","宁乡中拓瑞宁","浏阳中拓诚丰集里","长沙兰天城南","长沙兰天含浦"],"株洲市":["株洲海联","株洲兰天河西","株洲兰天攸县"],"岳阳市":["岳阳华日","岳阳华日南苑"],"衡阳市":["衡阳高卫","衡阳高翔"],"常德市":["常德日丰","常德柳城"],"郴州市":["郴州日通"],"湘潭市":["湘潭九华"],"怀化市":["怀化兰天恒裕"],"邵阳市":["邵阳兰天"],"益阳市":["益阳兰天"],"娄底市":["娄底兰天"],"永州市":["永州高翔"],"湘西土家族苗族自治州":["吉首吉日"]},"福建省":{"福州市":["福州中升福瑞","福州中升福新","福州中升福裕","福清华盛","福州汇京金山","福州汇京福飞北"],"泉州市":["泉州汇京银河","晋江汇京豪信","泉州汇京亿兴","泉州汇京友联","泉州汇京亿利"],"漳州市":["漳州聚力","漳州聚力合兴"],"厦门市":["厦门塞尔福轩泰","厦门塞尔福滨海","厦门瑞荣嘉诚海沧","厦门塞尔福金湖"],"龙岩市":["龙岩佳和","龙岩汇京龙兴"],"莆田市":["莆田华宝"],"宁德市":["宁德和信东侨"],"南平市":["南平福鑫"],"三明市":["三明中升华荣"]},"广东省":{"深圳市":["深圳东风南方华鹏","深圳东风南方华新","深圳东风南方华翔","深圳裕朋","深圳东风南方华旭","深圳新大兴","深圳东风南方华瑞","深圳东风南方华龙","深圳东风南方华昌","深圳东风南方华景","深圳东风南方观澜华盛"],"揭阳市":["揭阳恒悦","揭阳恒宇"],"河源市":["河源九牧"],"惠州市":["惠州中安","惠州俊通","惠州天驿","惠州南菱君达","惠州永惠","惠州天马","惠州安捷"],"汕尾市":["汕尾中升恒通"],"广州市":["广州风日","广州东风南方中大","广州华溢石槎","广州喜龙","广州金冠","广州东风南方广大","广州京安","广州广裕","广州广利","广州耀骏","广州龙日","广州东风南方黄埔","广州南沙大昌行喜龙","广州华溢街口","广州南菱","广州东风南方广辰","广州金冠明珠","广州绿日"],"汕头市":["汕头中升恒达","汕头中升恒利"],"佛山市":["佛山利泰","顺德协力","南海雄峰","佛山吉泰","顺德东炬","佛山利隆","佛山禅车城","顺德金桂","佛山广物锐祥","顺德庆丰龙江","佛山明泰"],"江门市":["江门江沙","江门利丰","江门丰泰","江门昌泰台山"],"东莞市":["东莞东风南方莞太","东莞东风南方大兴","东莞东风南方莞樟","东莞东风南方东益","东莞东风南方东深","东莞东风南方莞龙","东莞东风南方东兴","东莞东风南方金美","东莞东风南方龙平","东莞东风南方振安","东莞东风南方塘厦"],"中山市":["中山众杰","中山东日","中山创世纪","中山创日","中山创诚","中山名城"],"湛江市":["湛江骏浩","湛江东升行"],"茂名市":["茂名金泰","茂名广利成","茂名铭泰高州"],"肇庆市":["肇庆合利","肇庆合利恒四会"],"珠海市":["珠海明珠","珠海南屏","珠海黄浦"],"阳江市":["阳江金山","阳江广宝丰","阳江阳春溢美"],"梅州市":["梅州春天","梅州春天梅江","梅州春天兴宁"],"韶关市":["韶关通九州","韶关通九州韶冶"],"清远市":["清远金江","清远银山英德"],"云浮市":["云浮怡诚","云浮罗定怡诚"],"潮州市":["潮州侨山","潮州侨美"]},"广西省":{"南宁市":["南宁弘帆","南宁瑞帆","南宁广缘","南宁弘天","南宁广缘仙葫"],"桂林市":["桂林友爱","桂林真龙大成"],"柳州市":["柳州航盛","柳州骏朋"],"玉林市":["玉林弘鹏","玉林汇利成"],"北海市":["北海弘盛"],"贵港市":["贵港金港"],"梧州市":["梧州合利丰"],"河池":["河池弘池"],"钦州市":["钦州广缘金海湾"],"防城港市":["防城港鑫广达"],"百色":["百色广缘城东"],"贺州":["贺州合利诚"]},"海南省":{"海口市":["海口东风南方海鹏","海口东风南方海龙","海口东风南方海神"],"三亚市":["三亚东风南方海燕"],"琼海市":["琼海东风南方海豹"],"儋州市":["儋州东风南方军屯海兴"]},"重庆市":{"重庆市":["重庆盛泰","重庆东风南方渝兴","重庆商社西星","重庆都灵","万州盛泰飞骏","重庆东风南方渝发","重庆东风南方渝东","涪陵商社文化"]},"四川省":{"成都市":["成都中升益佳","成都港宏","成都三和金牛","成都启阳","成都申科蓉","成都港宏成华","成都汇京川成","成都启阳锦江","成都申蓉兴泓","成都启阳北星","成都中升津通","都江堰欣荣铭泰","成都东风南方鸿羽"],"绵阳市":["绵阳东风南方绵兴","江油东风南方绵旺"],"内江市":["内江星和"],"雅安市":["雅安超越雨城"],"南充市":["南充东风南方树生"],"攀枝花市":["攀枝花启阳攀西"],"泸州市":["泸州百通"],"眉山市":["眉山超越"],"达州市":["达州新川"],"乐山市":["乐山联合"],"广安市":["广安东风南方广生"],"自贡市":["自贡四达翔宏"],"宜宾市":["宜宾河田翠屏"],"遂宁市":["遂宁东风南方遂发"],"巴中市":["巴中云峰","巴中东恒云峰"],"西昌市":["西昌启阳"],"德阳市":["德阳东风南方西林"]},"西藏":{"拉萨市":["拉萨协合"]},"贵州省":{"贵阳市":["贵阳乾通","贵阳东风南方黔兴","贵阳广汇华跃"],"遵义市":["遵义汇川","遵义东风南方黔发"],"凯里市":["凯里通源"],"六盘水市":["六盘水东风南方黔旺"],"兴义市":["兴义恒信东顺"],"毕节市":["毕节佰润"],"安顺市":["安顺恒信东顺"],"铜仁市":["铜仁恒信东顺万山"],"都匀市":["都匀东风南方万胜"]},"云南省":{"昆明市":["昆明中升华通世博","昆明中升广福","昆明中升景通","昆明东风南方三佳"],"曲靖市":["曲靖中升靖通麒麟","曲靖珠江源大道"],"红河州":["红河中升红通天马"],"楚雄市":["楚雄中升骏通"],"文山壮族苗族自治州":["文山中升文通"],"保山市":["保山弘信永昌"],"普洱市":["普洱鸿达博盛思茅"],"德宏傣族景颇族自治州":["德宏弘信达程"],"玉溪市":["玉溪东风南方佳兴"],"西双版纳":["版纳东风南方佳旺"],"大理市":["大理东风南方东明"],"丽江市":["丽江东风南方金山"],"昭通市":["昭通晟烽"]}};

	function insert_data(data,obj){
		$.each(data, function(i, n){
			obj.append("<li><a href='javascript:;'>"+i+"</a></li>");
		});
	}
	function insert_arrdata(data,obj){
		$.each(data, function(i,n){
			obj.append("<li><a href='javascript:;'>"+n+"</a></li>");
		});
	}
	function reset_data(obj){
		obj.empty();
		//obj.prev().html("请选择");
		obj.parent().next().val("");
	}
	function reset_address(obj){
		obj.val("");
	}
	function submitOrder(prefix) {
		var data = {};
		jQuery('#yuyue_form input[id|="' + prefix +'"], #yuyue_form select[id|="' + prefix + '"]').each(function() {
			data[jQuery(this).attr('name')] = jQuery(this).val();
		});
		jQuery.post('/order/default', data, function(json) {
			alert(json.message);
		}, 'json');
	}
	$yy_address = $("#yy_address");
	$(".fakeselect").on("click","a",function(){
		if ($(this).parent().parent().attr('id') == 'yy_province') {
			$('#yy_city').siblings().text('请选择');
			$('#yy_address').siblings().text('请选择');
		}
		if ($(this).parent().parent().attr('id') == 'yy_city') {
			$('#yy_address').siblings().text('请选择');
		}
		var _box=$(this).parent();
		var _list=_box.parent();
		var _text = $(this).parents("div.fakeselect").next();
		_box.addClass('current').siblings().removeClass('current');
		_list.hide().prev().text($(this).text());
		_text.val($(this).text());

		if(_list.is("#yy_province")){
			reset_data($("#yy_city"));reset_data($("#yy_address"));
			$yy_province=$(this).html();
			if($yy_province) insert_data($yuyue[$yy_province],$("#yy_city"));
		}else if(_list.is("#yy_city")){
			reset_data($("#yy_address"));
			$yy_city=$(this).html();
			if($yy_city) insert_arrdata($yuyue[$yy_province][$yy_city],$("#yy_address"));
		}else if(_list.is("#yy_address")){
			$yy_address=$(this).html();
		}else return false;
	});
	//* 初始化数据
	insert_data($yuyue,$("#yy_province"));
});

